{"description":"Lectric eBikes (https://lectricebikes.com/) stepped up to sponsor ANOTHER video. This incredible company has proven their firm commitment to helping us build a better world by sponsoring 8 videos this year. Not only do they make affordable, fun, eco-friendly bikes, they make a difference by supporting our work across the planet. Please go visit their website and show them some appreciation for all their continued, astounding generosity.\n#ad  \n\nFrancis and his team at CDVTA (https://www.cdvta.org/) are some of the most dedicated people we have ever met. They have sacrificed so much to help build a stronger and more prosperous society in Cameroon.  The Cameroonian people are kind, loving, and welcoming, and having such a reliable and dedicated partner in Cameroon makes our work so much easier. Please click the \"Donate\" buttonor visit https://go.rallyup.com/designingenduringchangeincameroon/Campaign/Details  to help support Francis and his team across Cameroon. \n\nAlso, massive shoutout to Banko Design (https://bankodesign.com/) for supporting this project by building even more classrooms at this school. \n\nThank you to all the students, teachers, staff, PTA, community leaders, principal and village elders at Government Bilingual High  School (GBHS) Manengwassa-Loum  in Moungo Division of the Littoral Region of Cameroon for the exceptionally warm welcoming and for the immense honor you bestowed on Darren.\n\nFollow us so we can help more people together:\nInstagram: https://www.instagram.com/beastphilanthropy/\nWebsite: https://www.beastphilanthropy.org/\nTiktok: https://www.tiktok.com/@beastphilanthropy \nTwitter: https://twitter.com/BeastPhilanthr \nFacebook: ​​https://www.facebook.com/profile.php?id=100084586484118\nSpotify: https://open.spotify.com/artist/400iD3n8DqB8wGqxDv6pSB\n\nBeast Philanthropy Video Disclaimer: This video was produced by Beast Philanthropy Productions, LLC, a North Carolina limited liability company. Any revenue generated for Beast Philanthropy Productions, LLC from this video will be donated to MrCharity, Inc. dba Beast Philanthropy, a North Carolina 501(c)(3) nonprofit corporation. #sponsored\n\nFilmed and Edited by: Dan Mace (@DanMace )","title":"We Built A School","duration":360,"channel_id":"UCAiLfjNXkNv24uhpzUgPa6A","author":"Beast Philanthropy","date":"20231224","url":"https://www.youtube.com/watch?v=OCKQBMlXeGc","thumbnail":"https://i.ytimg.com/vi/OCKQBMlXeGc/hqdefault.jpg","content":{"View count":44455090}}
