{"description":"I created my dream tank, a 1000 gallon cloud rainforest vivarium, and constructing it has been quite a journey. It is fully stocked with tropical plants, automated climate control, and even some creatures that managed to sneak in through the terrarium decor. However, the goal of the vivarium experiment was to recreate and study a rainforest ecosystem so to complete the project, I needed to add more animals. Little did I know, doing so would amp up the biological action within the vivarium in a way that I could never have predicted. Hope you enjoy Part 6 of my ecosystem vivarium series. Ant love forever! This video was shot in 4K Ultra HD resolution.\n\nJoin the Great AC SENATE to get access to new perks/voting powers on this channel:\nhttps://www.youtube.com/channel/UCONd1SNf3_QqjzjCVsURNuA/join\n\nClick here to SUBSCRIBE: https://goo.gl/tlCQJZ\n\nDirected/Written/DOP/Edited by AntsCanada\nExecutive Producer RJ Garcia\n\nSpecial thanks to nature photographer and biologist Alex Wild for allowing his photos to be used in our videos. Check out his amazing nature photography and order some prints: http://www.alexanderwild.com\n\nIf you're new to the channel, catch up on your \"AntsCanada Lore\" with this playlist of the complete history of the ants of this channel: https://goo.gl/hVFxc2\n\nVisit us at http://www.antscanada.com \n\nA brand new video is uploaded on this channel every Saturday at 8AM EST (with frequent bonus videos) so be sure to SUBSCRIBE to the channel to catch every ant video we release! Thank you for the support.\n\nGet our new AC Hybrid Nest 2.0 ant farm or\n'All You Need' Hybrid 2.0 Gear Pack (complete kit): https://www.antscanada.com/product-category/hybrid-nest-series/\n\n\n▶▶▶We've got new Ant T-shirts! Check them out here: https://goo.gl/PjnB7t\n\n▶▶▶Got a question about ants or AntsCanada? Visit our website FAQ: https://goo.gl/mJPEqn\n\n▶▶▶Want an ant farm? Check out our ant shop. We ship worldwide: http://goo.gl/I4l7Ho \n\n▶▶▶Need to buy an ant colony for your ant farm, or do you have ant colonies to sell/give away? Find out more about our GAN Project: http://goo.gl/jzo9Lc\n\nJoin us at the new AntsCanada Ant Forum: http://forum.antscanada.com\n\n▶AntsCanada Official Website http://www.antscanada.com\n▶Like us on http://facebook.com/antscanada \n▶Follow us on http://twitter.com/antscanada\n▶Follow us on http://www.instagram.com/antscanada\n\nEmail us at info@antscanada.com for any questions or inquiries.\n\nAbout AntsCanada.com: We believe ants are the most amazing creatures on the planet, and every new discovery about their micro world gives us some profound insights into the world around us and ourselves. Bringing the ant farm and love of ant keeping to a whole new level, we are dedicated to show the world the joys of keeping big and healthy pet ant colonies. Shipping worldwide since 2009, we are innovators of ant keeping products for ant lovers and museums alike.","title":"I Added Animals Into My Giant Rainforest Vivarium","duration":2061,"channel_id":"UCONd1SNf3_QqjzjCVsURNuA","author":"AntsCanada","date":"20231231","url":"https://rr4---sn-p5qlsn6l.googlevideo.com/videoplayback?expire=1753901370&ei=2hSKaOjaJo2UkucPk-6y0QY&ip=4.227.173.118&id=o-AKGmmNjNG9HRaQpbDyUP_Ew-Z6E7QFMJoOBAbviHPflr&itag=18&source=youtube&requiressl=yes&xpc=EgVo2aDSNQ%3D%3D&met=1753879770%2C&mh=3j&mm=31%2C26&mn=sn-p5qlsn6l%2Csn-5ualdnle&ms=au%2Conr&mv=m&mvi=4&pl=17&rms=au%2Cau&initcwndbps=5532500&bui=AY1jyLOOLDSpzrc_BlTNFHLmCy5GI34DxRX8BtrpjhhculaZA39qK5sxzYULI61k63SxwhZEmNHnEMh_&vprv=1&svpuc=1&mime=video%2Fmp4&ns=Q0qdV0cRTjECsDPszXJmCwUQ&rqh=1&cnr=14&ratebypass=yes&dur=2060.956&lmt=1752133875577171&mt=1753879041&fvip=3&fexp=51355912&c=WEB&sefc=1&txp=5538534&n=II5Gu2BQDOOymQ&sparams=expire%2Cei%2Cip%2Cid%2Citag%2Csource%2Crequiressl%2Cxpc%2Cbui%2Cvprv%2Csvpuc%2Cmime%2Cns%2Crqh%2Ccnr%2Cratebypass%2Cdur%2Clmt&sig=AJfQdSswRgIhAJFdtn53CxVn00RibpdSA3_jPXduK1bjlqgRaeLY5r1mAiEAhnUCQDFsCaBne2BlMcAf3EWMpFvpQOBDUlWwUAG9L1w%3D&lsparams=met%2Cmh%2Cmm%2Cmn%2Cms%2Cmv%2Cmvi%2Cpl%2Crms%2Cinitcwndbps&lsig=APaTxxMwRAIgaG7RGhx56FUOCmFZODNwuYdNfgyvWF2ppwyR4bMkh1cCIH5EgDByayOnPYBT-nyuwqfHWaDn9VswigtOQnMPo8xR","thumbnail":"https://i.ytimg.com/vi/lSjSLJ8LPkA/hqdefault.jpg","content":{"View count":10252623}}
