{"description":"Steve-O returns to face for this THIRD showdown with the wings of death in the THIRD Annual Hot Ones Holiday Extravaganza! This end-of-year tradition is our way of saying thank you to the fans and raising money for our official Hot Ones charity partner, Common Threads. And what a show we have in store: Sean Evans plays a holiday-themed round of \"would you rather?\" with kids of Common Threads! Esther Choi (Heat Eaters) cooks Nashville-style Korean fried chicken with Hot Ones legend Chili Klaus! Camera Guy Bill presents the 2023 Hot Ones Awards! And Steve-O takes on the wings of death and discusses his Hot Ones history, Jackass lore, and an elusive stunt he's always wanted to try. His latest special “Steve O’s Bucket List” is now available at SteveO.com We hope you enjoy the show, and if you’re a fan of Hot Ones and First We Feast, we’d appreciate nothing more than a donation to Common Threads—just smash that donation button!\n\nCHAPTERS:\n00:00 - 03:30: Sean's Greetings\n03:30 - 10:02: Esther & Chili Klaus Make Korean Fried Chicken   \n10:03 - 13:46: Sean & Kids Play Would You Rather?   \n13:47 - 21:04: Hot Ones Awards 2023   \n21:04 - 37:58: Steve O Hot Ones  \n37:59 - 39:21: Sean's Closing Remarks & Credits\n\nBUY HOT ONES HOT SAUCE NOW: https://fwfea.st/hotsauces\n\nTRY THE HOT ONES BONELESS CHICKEN BITE CHALLENGE: https://fwfea.st/chickenbites\n\nBUY HOT ONES TRUTH OR DAB: THE GAME: http://truthordabgame.com\n\nSIGN UP FOR THE HOT ONES MONTHLY HOT SAUCE SUBSCRIPTION: https://bit.ly/2veY50P\n\nSIGN UP FOR THE FIRST WE FEAST NEWSLETTER: http://firstwefeast.com/signup\n\nSUBSCRIBE TO FIRST WE FEAST ON YOUTUBE: http://goo.gl/UxFzhK\n\nMAKE A DIFFERENCE BY DONATING TO COMMON THREADS, THE OFFICIAL  CHARITY PARTNER OF HOT ONES: https://www.commonthreads.org/firstwefeast/\n\nCheck out more of First We Feast here:\n\nhttp://firstwefeast.com/\nhttp://instagram.com/firstwefeast\nhttp://instagram.com/hotones/\nhttps://twitter.com/firstwefeast\nhttps://www.facebook.com/FirstWeFeast","title":"Steve-O Is Extra Naughty For the Hot Ones Holiday Extravaganza | Hot Ones","duration":2361,"channel_id":"UCPD_bxCRGpmmeQcbe2kpPaA","author":"First We Feast","date":"20231221","url":"https://www.youtube.com/watch?v=5h34UmoAjvk","thumbnail":"https://i.ytimg.com/vi/5h34UmoAjvk/hqdefault.jpg","content":{"View count":1676379}}
